ngo/app/Controllers/Ngos.php

SELECT *
FROM `ngos`
WHERE `id` = '2'
 LIMIT 1
SELECT `id`, `name`
FROM `states`
SELECT `id`, `name`
FROM `cities`
---
        public function ngo_view($id)
        {
            if(isset($this->userdata['id'])){
                $data["is_applied"] = 0;
                $model = new Ngo;
                $data["ngo"] = $model->where('id',$id)->first();
                if($data["ngo"]) {
                    $model = new State;
                    $data["states"] = $model->select("id,name")->get()->getResultArray();

                    $model = new City;
                    $data["cities"] = $model->select("id,name")->get()->getResultArray();

SELECT `n`.`id`, `n`.`name`, `n`.`email`, `n`.`phone`, `n`.`address`, `s`.`name` AS `state`, `c`.`name` AS `city`
FROM `ngos` `n`
JOIN `states` `s` ON `s`.`id`=`n`.`state`
JOIN `cities` `c` ON `c`.`id`=`n`.`city`
WHERE `n`.`is_approved` = 1
---
        public function all_ngos()
        {
            $session = session();
            if(isset($this->userdata['id'])){
                $model = db_connect();
                $ngo = $model->table("ngos n");
                $ngo = $ngo->join("states s","s.id=n.state");
                $ngo = $ngo->join("cities c","c.id=n.city");
                $ngo = $ngo->select("n.id,n.name,n.email,n.phone,n.address,s.name AS state,c.name AS city");
                $ngo = $ngo->where("n.is_approved",1);
                $data["ngos"] = $ngo->get()->getResultArray();